docs: Greg reviews
